{
  "tests": [
    {
      "test_id": "test_001",
      "modes": {
        "General": {
          "task1": {
            "question_text": "The company you work for is planning to provide special training for staff. Your duty is to find out if the local conference centre has suitable facilities in order to hold the training. Write a letter to the manager of the conference centre.In your letter  • Give some details about the training course • Describe what kind of equipment you will need for the course  • Ask some questions about the facilities at the conference centre. Write at least 150 words."
          },
          "task2": {
            "question_text": " Some people think that the teenage years are the happiest times of most people's lives. Others think that adult life brings more happiness, in spite of greater responsibilities. Discuss both these views and give your own opinion. Give reasons for your answer and include any relevant examples from your own knowledge or experience.Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The diagram below shows the process for recycling plastic bottles.Summarise the information by selecting and reporting the main features, and make comparisons where relevant.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/9MyWgbqZ/test-001-ielts-graph-how-plastic-bottles-are-recycled.png"
          },
          "task2": {
            "question_text": "As mass communication and transport continue to grow, societies are becoming more and more alike, leading to a phenomenon known as globalization. Some people fear that globalization will inevitably lead to the total loss of cultural identity. To what extent do you agree or disagree with this statement? Give reasons for your answer and include any relevant examples from your own knowledge or experience.You should write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_002",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You are due to start a new job next week but you will not be able to because you have some problems.Write a letter to your new employer. In your letter• explain your situation• describe your problems• tell him/her when you think you can start.You should write at least 150 words."
          },
          "task2": {
            "question_text": "People who live in big cities face a range of problems in their daily life.What are the main problems people in cities have, and how can these problems be solved?Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The first graph gives the number of passengers travelling by train in Sydney. The second graph provides information on the percentage of trains running on time.Summarise the information by selecting and reporting the main features, and make comparisons where relevant.You should write at least 150 words.",
            "image_url": "https://i.postimg.cc/pL7R24fK/test-002-graph-314-number-of-train-passengers-1995-2004.png"
          },
          "task2": {
            "question_text": "In many countries, it is mandatory for school children to wear uniforms. Do the advantages of this policy outweigh the disadvantages? Give reasons for your answer and include any relevant examples from your own knowledge or experience.Write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_003",
      "modes": {
        "General": {
          "task1": {
            "question_text": "On a recent holiday you lost a valuable item. Fortunately you have travel insurance to cover the cost of anything lost.Write a letter to the manager of your insurance company. In your letter:• Describe the item you lost• Explain how you lost it.• Tell the insurance company what you would like them to do.You should write at least 150 words."
          },
          "task2": {
            "question_text": "Universities should provide students with the skills they will require in order to succeed at their future jobs.How far do you agree or disagree with the above opinion?What are some of the job skills that employers look for in new employees?Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "Charts A and B show the share of the UK and Australian cinema market in 2001 and cinema admission in the UK and Australia from 1976 to 2006.Write a report for a university lecturer describing the information shown below.You should write at least 150 words.",
            "image_url": "https://i.postimg.cc/sxwCbNfQ/test-003-graph-317-films-screened-in-uk-and-australia.png"
          },
          "task2": {
            "question_text": "Some people believe that people living in the twenty-first century have a better standard of living as compared to previous centuries. To what extent do you agree or disagree with this statement? Give reasons for your answer and include relevant examples from your knowledge or experience.Write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_004",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You travelled by plane last week and your suitcase was lost. You have still heard nothing from the airline company.Write to the airline and• explain what happened• describe your suitcase and tell them what was in it• find out what they are going to do about itYou should write at least 150 words."
          },
          "task2": {
            "question_text": "Some experts believe that it is better for children to begin learning a foreign language at primary school rather than secondary school.Do the advantages of this outweigh the disadvantages?Write at least 250 words"
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The plans below show a public park when it first opened in 1920 and the same park today.Summarise the information by selecting and reporting the main features, and make comparisons where relevant.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/hj1k75dy/test-004-public-park-in-1920-and-today.png"
          },
          "task2": {
            "question_text": "These days more people put their personal information, such as names, addresses and telephone numbers, online for everyday activities such as socialising on social networks or banking purposes. Do you think it is a positive or negative development? Write atleast 250 words"
          }
        }
      }
    },
    {
      "test_id": "test_005",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You want to sell some of your furniture. You think a friend of yours might like to buy it from you.Write a letter to your friend. In your letter• explain why you are selling• describe the furniture• suggest a date when your friend can come and see the furnitureWrite at least 150 words."
          },
          "task2": {
            "question_text": "Some people prefer to spend their lives doing the same things and avoiding change. Others, however, think that change is always a good thing.Discuss both these views and give your own opinion.Write atleast 250 words"
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The table below shows the number of medals won by the top ten countries in the 2016 Rio Olympic Games.Summarise the information by selecting and reporting the main features, and make comparisons where relevant.You should  write at least 150 words.",
            "image_url": "https://i.postimg.cc/ZnqMvKZn/test-005-medals-by-countries-in-2016-rio-olympic.png"
          },
          "task2": {
            "question_text": "People produce more carbon emissions and garbage than in the past. Explain how it is affecting us and the measures that could be taken to address the situation.Provide specific examples and explanation to support your answer. Write atleast 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_006",
      "modes": {
        "General": {
          "task1": {
            "question_text": "Write a letter to your friend from a different country. Invite him/her to a party at your home and include the following:what the party is about•give directions on how to get to your place•suggest how to accommodate him/herWrite at least 150 words."
          },
          "task2": {
            "question_text": "Traditionally, elderly people have lived with and been cared for by younger family members. In modern society, more and more elderly people are living in special homes for the elderly.Why do you think families choose to have their elderly relatives live in special homes away from family?What do you think is the best way for modern families to care for their elderly relatives? Write atleast 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The chart below shows the type of transports young people in four countries prefer to use.Summarize the information by selecting and reporting the main features, and make comparisons where relevant.You should write at least 150 words.",
            "image_url": "https://i.postimg.cc/DzZ6cpHp/test-006-type-of-transports-young-people-prefer.png"
          },
          "task2": {
            "question_text": "In some countries police officers do not carry guns. How does this affect the manner they implement law and order? Discuss the advantages and disadvantages of having a gun. Provide specific reasons and examples to support your opinion. Write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_007",
      "modes": {
        "General": {
          "task1": {
            "question_text": "Your friend's dog has recently passed away.Write a letter to console your friend. In your letter:Express your sympathy •Include memories you have about the dog •Invite your friend to do something with you Write at least 150 words."
          },
          "task2": {
            "question_text": "Shopping is becoming more and more popular as a leisure activity. However, some people feel that this has both positive and negative effects.Why is shopping so popular?What effects does its increase in popularity have on individuals and on society?Write at least 250 words"
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The chart below shows the relative percentage of different types of cheese production in the USA.Write a report for a university lecturer describing the information shown in the diagrams below.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/nr0MT26T/test-007-cheese-production-usa.png"
          },
          "task2": {
            "question_text": "Some parents do not allow their children to watch action films and blood sports or play violent video games because it promotes bad behaviour. Others say it does not. Which opinion do you agree with and why?Give specific examples and details in your explanation.Write at least 250 words. "
          }
        }
      }
    },
    {
      "test_id": "test_008",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You applied to a job, were offered the position, but have decided not to accept the offer.Write a letter to the HR supervisor with whom you interviewed. In your letter:•Explain the reason why you are declining the offer•Describe your reasons for staying with your current position•Express your gratitudeWrite at least 150 words. "
          },
          "task2": {
            "question_text": "In Britain, when someone gets old they often go to live in a home with other old people where there are nurses to look after them. Sometimes the government has to pay for this care.Who do you think should pay for this care, the government or the family?Write atleast 250 words"
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The diagram below shows the manufacturing process for making sugar from sugar cane.Summarise the information by selecting and reporting the main features, and make comparisons where relevant.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/tJy2FRjW/test-008-how-sugar-is-produced.png"
          },
          "task2": {
            "question_text": "Research has shown that the transportation of products and people are the main source of pollution. Some people believe the government should be in charge of this, while others believe it is the fault of individuals. Discuss both views and give your opinion. Give reasons for your answer and include relevant examples from your knowledge or experience. "
          }
        }
      }
    },
    {
      "test_id": "test_009",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You are due to move into a rented apartment next week but you will not be able to due to an unexpected problem.Write a letter to the property manager. In your letter•Explain the situation•Describe your problems•Tell him/her when you think you can move inWrite at least 150 words.  "
          },
          "task2": {
            "question_text": "Some schools start teaching a foreign language in primary school years. Do the advantages of teaching languages to young children outweigh the disadvantages? Give your own opinion and examples.Write at least 250 words. "
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The line graph below shows how much people in four countries spent on purchasing books from 1995 to 2005.Summarise the information by selecting and reporting the main features and make comparisons where relevant.Write at least 150 words.Money spent on Books",
            "image_url": "https://i.postimg.cc/DZbw1Fgv/test-009-money-spent-on-books.png"
          },
          "task2": {
            "question_text": "Some people believe that governments should make the ​investment in building public libraries in every town, while others think it is a waste of money because we have access to information via the Internet. Discuss both these views and give your own opinion.Write at least 250 words"
          }
        }
      }
    },
    {
      "test_id": "test_010",
      "modes": {
        "General": {
          "task1": {
            "question_text": "A friend of yours is going on holiday soon and has asked you to recommend a destination.Write a letter to your friend. In your letter:Recommend a good place for a holiday that you have visited•Describe where you stayed and what you can do there•Provide one negative aspect about the destinationWrite at least 150 words. "
          },
          "task2": {
            "question_text": "Some people think that parents should teach their children how to be good members of society. Others, however, believe that school is the best place to learn this. Discuss both views and give your own opinion.Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The chart shows the number of visitors to a local cinema according to age in 2000.Summarise the information by selecting and reporting the main features and make comparisons where relevant. Write at least 150 words.Visitors to the local cinema according to age",
            "image_url": "https://i.postimg.cc/26vZdgFD/test-010-visitors-to-cinema-in-2000.png"
          },
          "task2": {
            "question_text": "Some people believe that international sporting events are the ideal opportunity to show the world the qualities of the hosting nations. Others believe that these events are mainly a large unjustifiable expense. To what extent do you agree or disagree? Write at least 250 words"
          }
        }
      }
    },
    {
      "test_id": "test_011",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You are moving to a new city for work and have just realized that an old friend lives in the city.Write a letter to your friend. In your letter:•Ask them for advice in finding accommodation•Tell them where you would like to live•Tell them the type of place you are looking forWrite at least 150 words."
          },
          "task2": {
            "question_text": "Increasingly, people eat food from other parts of the world, rather than local food. What do you think is driving this trend? Is this a good or bad development? Give reasons for your answer and include any relevant examples from your own knowledge or experience.Write at Least 250 words"
          }
        },
        "Academic": {
          "task1": {
            "question_text": "Chorleywood is a village near London whose population has increased steadily since the middle of the nineteenth century. The map below shows the development of the village.Write a report for a university lecturer describing the development of the village.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/1Xm3gdvM/test-011-population-increase-in-chorleywood.jpg"
          },
          "task2": {
            "question_text": "Art classes such as painting or drawing are important for children's development so it should be compulsory in high school. Do you agree or disagree? Write atleast 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_012",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You play a team sport with some friends. Last week a member of the team had an accident and wasn't able to play with you. Write a letter to your friend. In your letter:•Tell him which team won•Describe the weather conditions that day•Say how you felt about the matchWrite at least 150 words. "
          },
          "task2": {
            "question_text": "Mobile phones have brought many benefits, but they have also had negative effects.Do the disadvantages of having mobile phones outweigh the advantages?"
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The chart below shows the average daily minimum and maximum levels of two air pollutants in four big cities in 2000.Summarise the information by selecting and reporting the main features and make comparisons where relevant. You should write at least 150 words.",
            "image_url": "https://i.postimg.cc/nVNQSFwt/test-012-air-pollution-in-four-big-cities.png"
          },
          "task2": {
            "question_text": "Some people think that printed books are no longer needed in this digital world as  writings can be stored electronically. Others believe that printed books still play an important role. Discuss both the views and give your opinion.Write atleast 250 words"
          }
        }
      }
    },
    {
      "test_id": "test_013",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You need to take some time off of work to go on holiday.Write a letter to your direct manager. In your letter:•Ask for time off and explain why•Provide the dates and times for which you will be unavailable to work•Describe what you will do to prepare or make up for your absenceWrite at least 150 words.  "
          },
          "task2": {
            "question_text": "Some people today feel that physical money will no longer be used in the future. Others feel it will still have some uses.Discuss both sides and give your own opinion. Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The pie charts below describe average household expenditures by major categories in Japan and Malaysia in 2010. Write a report for a university lecturer describing the information shown.You should write at least 150 words.",
            "image_url": "https://i.postimg.cc/XJmXPLLg/test-013-household-expenditures-japan-2010.png"
          },
          "task2": {
            "question_text": "Some people believe that governments should enact laws on nutrition and food choices to improve public health, while others believe that it is a matter of personal choice and responsibility. Discuss both points of view and give your opinion. Write atleast 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_014",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You recently went on a trip with a friend and you both took some photographs.Write a letter to your friend. In your letter:•Ask your friend to send you a particular photograph•Explain why you need that particular photograph•Tell your friend what happened to your copy of itWrite at least 150 words."
          },
          "task2": {
            "question_text": "In some countries today, children are taught from a young age that competition is important and that winning is everything.Is this a positive or a negative development? Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The table below shows the results of surveys in 2000, 2005 and 2010 about one university.Summarise the information by selecting and reporting the main features, and make comparisons where relevant.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/3x1NhY9N/test-014-studernt-rating-good-aspects-of-university.png"
          },
          "task2": {
            "question_text": "Some museum charge entry fees while others have free entry. Do you think the advantages of charging an entry fee outweight the disadvantages? Give reasons for your answer and include relevant examples from your own knowledge or experiences. Write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_015",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You are going on holiday and have just remembered that your aunt lives in one of the cities you will be visiting.Write a letter to your aunt. In your letter:•Tell her about your holiday plans•Ask if you can stay with her for a portion of the trip•Explain how you will make it up to her Write at least 150 words. "
          },
          "task2": {
            "question_text": "Schools should focus on academic success and passing examinations. Skills such as cookery, dressmaking and woodworking should not be taught at school as it is better to learn these from family.To that extent do you agree or disagree? Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The following diagram shows how greenhouse gases trap energy from the Sun. Write a report for a university lecturer describing the information shown in the diagram.Summarise the information by selecting and reporting the main features and make comparisons where relevant.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/1Xd0JDVx/test-015-greenhouse-gases-trap-energy-from-sun.jpg"
          },
          "task2": {
            "question_text": "Some people say that the best way to improve public health is by increasing the number of sports facilities. Others,however , say that this would have little effect on pyblic health and that other measures are required. Discuss both views and give your opinoin.Write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_016",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You and a friend have both been accepted to a study abroad program in Paris, France.Write a letter to your friend. In your letter:•Congratulate him/her for also being accepted•Ask him/her if he/she would like to be your roommate•Discuss possible activities that the two of you could do togetherWrite at least 150 words."
          },
          "task2": {
            "question_text": "Some people believe that in a city, the best way to travel is by car, while other people argue that bicycles are a better way of travelling in a city.Discuss both views and give your opinion. Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The diagrams below show the stages and equipment used in the cement-making process, and how cement is used to produce concrete for building purposes.Summarise the information by selecting and reporting the main features, and make comparisons where relevant.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/7PJNZQFw/test-016-cement-making-process.jpg"
          },
          "task2": {
            "question_text": "Some people believe that in order to reduce crimes, prisoners should be given longer prison sentences, while some people think there are other alternatives. Discuss both views and give your opinion.Write atleast 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_017",
      "modes": {
        "General": {
          "task1": {
            "question_text": "An English-speaking friend wants to spend a two-week holiday in your region and has written asking for information and advice.Write a letter to your friend.In your letter:Offer to find somewhere to stay•Give advice about what to do•Give information about what clothes to bring.Write at least 150 words."
          },
          "task2": {
            "question_text": "Some people believe that teaching children at home is best for a child’s development while others think that it is important for children to go to school.Discuss the advantages of both methods and give your own opinion. Give reasons for your answer and include any relevant examples from your own knowledge or experience.Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The graph below shows the percentage of households, grouped by poverty, on the basis of access to refrigerator, electricity and water in Ghana for the year 1991/1992 to 1998/1999. Summarise the information by selecting and reporting the main features, and make comparisons where relevant. You should write at least 150 words.",
            "image_url": "https://i.postimg.cc/sgsPKfvg/test-017-access-to-refrigerator-electricity-water-ghana.png"
          },
          "task2": {
            "question_text": "It has been noted that many people who had a big impact on the world gave themselves completely to their work and did not bother with the idea of “work-life balance”. To what extent should people try to have a good work-life balance? Give reasons for your answer and include any relevant examples from your own knowledge or experience.Write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_018",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You have recently started work in a new company.Write a letter to your friend. In your letter:•Explain why you changed jobs•Describe your new job•Tell him/her your other newsWrite at least 150 words."
          },
          "task2": {
            "question_text": "Some people think that having a set retirement age (e.g. 65 years) for everybody, regardless of occupation, is unfair. They believe that certain workers deserve to retire and receive a pension at an earlier age.Do you agree or disagree?Which types of workers do you think should benefit from early retirement?Give reasons for your answer and include any relevant examples from your own knowledge or experience.Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The graph below shows the proportion of the population aged 65 and over between 1940 and 2040 in three different countries. Summarise the information by selecting and reporting the main feature and make comparisons where relevant. Write at least 150 words.",
            "image_url": "https://i.postimg.cc/LX1Z2GnW/test-018-aged-population-between-1940-2040.gif"
          },
          "task2": {
            "question_text": "Machine translation (MT) is slower and less accurate than human translation and there is no immediate or predictable likelihood of machines taking over this role from humans. To what extent do you agree or disagree?Write at least 250 words."
          }
        }
      }
    },
    {
      "test_id": "test_019",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You have recently moved to a different city.Write a letter to your friend. In your letter:•Explain why you decided to move to a different city•Describe the new city and accommodation•Ask your friend to arrange a visitWrite at least 150 words. "
          },
          "task2": {
            "question_text": "Some people believe that children should be allowed to stay at home and play until they are six or seven years old. Others believe that it is important for young children to go to school as soon as possible.What do you think are the advantages of attending school from a young age?Give reasons for your answer and include any relevant examples from your own knowledge or experience.Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The diagram below shows the typical stages of consumer goods manufacturing, including the process by which information is fed back to earlier stages to enable adjustment. Write a report for a university lecturer describing the process shown.You should write at least 150 words.",
            "image_url": "https://i.postimg.cc/QdGYDrC2/test-019-stages-of-consumer-goods-manufacturing.gif"
          },
          "task2": {
            "question_text": "Every country should produce enough of everything that the country needs so it does not have to rely on imports. Do you agree or disagree with this statement? Use specific reasons and examples to support your position.Write atleast 250 words"
          }
        }
      }
    },
    {
      "test_id": "test_020",
      "modes": {
        "General": {
          "task1": {
            "question_text": "You have been busy with your studies for the past month and haven't had time to visit your family.Write a letter to your grandmother. In your letter:•Apologize for not getting in touch with her sooner•Explain why you have been so busy•Arrange a time to visitWrite at least 150 words."
          },
          "task2": {
            "question_text": "Some people think that the teenage years are the happiest times of most people's lives. Others think that adult life brings more happiness, in spite of greater responsibilities.Discuss both these views and give your own opinion.Give reasons for your answer and include any relevant examples from your own knowledge or experience. Write at least 250 words."
          }
        },
        "Academic": {
          "task1": {
            "question_text": "The diagram below shows how electricity is generated in a hydroelectric power station. Summarize the information by selecting and reporting the main features, and make comparisons where relevant.Write at least 150 words.",
            "image_url": "https://i.postimg.cc/HxxBzYvy/test-020-map-hydroelectric-power-station.png"
          },
          "task2": {
            "question_text": "Some people think that real-life skills like cooking, housekeeping and gardening should be included in the curriculum as compulsory subjects. Do you agree or disagree? Explain your opinion, using specific reasons and details.Write atleast 250 words"
          }
        }
      }
    }
  ]
}